# Q1. What is data encoding? How is it useful in data science?

# ans .. Every algoritham is work the numrical value so  data encoding  aim is convert the categorical data to numerical data

# Q2. What is nominal encoding? Provide an example of how you would use it in a real-world scenario.

#  ans.. Nominal encoding  is a technique used to transform categorical varibales that have no intrinsic ordering into numerical value   the Nominal encoding  one commn method  One hot encoding 
# ex.. we are to feature  1, no of room 2, location , output  location is the catogrical feature so this feature is canverta the numrical data

# Q3. In what situations is nominal encoding preferred over one-hot encoding? Provide a practical example.

In [1]:
import pandas as pd

In [2]:
l=["himanshu","ram","sham","rhada"]

In [3]:
pd.DataFrame(l)

          0
0  himanshu
1       ram
2      sham
3     rhada

# the given dataset is the catogrical data set so we are using the one hot encoding

# Q4. Suppose you have a dataset containing categorical data with 5 unique values. Which encoding technique would you use to transform this data into a format suitable for machine learning algorithms? Explain why you made this choice.

# ans

In [4]:
d=({
    'name':['ram','raja','rohan','himanshu','vandan','ram','raja','rohan','rohan','himanshu','vandan','ram','himanshu']
})

In [5]:
df=pd.DataFrame(d)

In [6]:
df

        name
0        ram
1       raja
2      rohan
3   himanshu
4     vandan
5        ram
6       raja
7      rohan
8      rohan
9   himanshu
10    vandan
11       ram
12  himanshu

In [7]:
# this is the data set  i'm using the one hot encoding

In [8]:
from sklearn.preprocessing import OneHotEncoder

In [9]:
encoder=OneHotEncoder()

In [11]:
df1=encoder.fit_transform(df[['name']])

In [12]:
df1

<13x5 sparse matrix of type '<class 'numpy.float64'>'
	with 13 stored elements in Compressed Sparse Row format>

In [16]:
df2=pd.DataFrame(df1.toarray(),columns=encoder.get_feature_names_out())

In [17]:
df2

    name_himanshu  name_raja  name_ram  name_rohan  name_vandan
0             0.0        0.0       1.0         0.0          0.0
1             0.0        1.0       0.0         0.0          0.0
2             0.0        0.0       0.0         1.0          0.0
3             1.0        0.0       0.0         0.0          0.0
4             0.0        0.0       0.0         0.0          1.0
5             0.0        0.0       1.0         0.0          0.0
6             0.0        1.0       0.0         0.0          0.0
7             0.0        0.0       0.0         1.0          0.0
8             0.0        0.0       0.0         1.0          0.0
9             1.0        0.0       0.0         0.0          0.0
10            0.0        0.0       0.0         0.0          1.0
11            0.0        0.0       1.0         0.0          0.0
12            1.0        0.0       0.0         0.0          0.0

In [20]:
pd.concat([df,df2],axis=1)

        name  name_himanshu  name_raja  name_ram  name_rohan  name_vandan
0        ram            0.0        0.0       1.0         0.0          0.0
1       raja            0.0        1.0       0.0         0.0          0.0
2      rohan            0.0        0.0       0.0         1.0          0.0
3   himanshu            1.0        0.0       0.0         0.0          0.0
4     vandan            0.0        0.0       0.0         0.0          1.0
5        ram            0.0        0.0       1.0         0.0          0.0
6       raja            0.0        1.0       0.0         0.0          0.0
7      rohan            0.0        0.0       0.0         1.0          0.0
8      rohan            0.0        0.0       0.0         1.0          0.0
9   himanshu            1.0        0.0       0.0         0.0          0.0
10    vandan            0.0        0.0       0.0         0.0          1.0
11       ram            0.0        0.0       1.0         0.0          0.0
12  himanshu            1.0        0.0       0.0         0.0          0.0

# Q5. In a machine learning project, you have a dataset with 1000 rows and 5 columns. Two of the columns are categorical, and the remaining three columns are numerical. If you were to use nominal encoding to transform the categorical data, how many new columns would be created? Show your calculations.

# ans .. the given dataset have the 1000 row and 5 columns   they have  two columns are categorical and remaning are numerical data  only  two columns are categrical data  so the  using the one hot encoding  i cheaked the  categoricat data how many unique value    the create the new columns are depnad the catgorical feature how many uniqe value

# Q6. You are working with a dataset containing information about different types of animals, including their species, habitat, and diet. Which encoding technique would you use to transform the categorical data into a format suitable for machine learning algorithms? Justify your answer.

# ans. the given data many type of animal   and  we have the many columns like , habitat,diet  , so solve this problem  i uesd the one hot encoding

#  Q7.You are working on a project that involves predicting customer churn for a telecommunications  company. You have a dataset with 5 features, including the customer's gender, age, contract type, monthly charges, and tenure. Which encoding technique(s) would you use to transform the categorical data into numerical data? Provide a step-by-step explanation of how you would implement the encoding.

# the given dataset are catgorical and numrical both value  so firstly i chossing the catogrical data  columns and after that  i import the the sklearn libary and  i using the one oht encoding and   after that scaling the one hot coding  and after that fit the data  and after that transeform the data  and the coming data convert to the dataframe   after that data concatinet the orignal data  the data is convert the   catgorical data to numrical data .